_Rarzrabotki/Rarus/USO2/Catalogs/УСОERP_ГрафикиАктированияФинансирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>УСОERP_ГрафикиАктированияФинансирования</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УдалитьКалендарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоКредитныеЭтапы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Календарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроизводственныеКалендари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидГрафика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_ВидыГрафиковАктированияФинансирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантАктирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_ВариантыАктирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сдвиг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Этапы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВариантОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыОплатыПоставщику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сдвиг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентЗалогаЗаТару</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/УСОERP_ВидыГрафиковАктированияФинансирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>УСОERP_ВидыГрафиковАктированияФинансирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ГрафикАктирования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГрафикФинансирования</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/ВариантыОплатыКлиентом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВариантыОплатыКлиентом</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АвансДоОбеспечения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредоплатаДоОтгрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КредитПослеОтгрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УСОERP_ГарантийноеУдержание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КредитСдвиг</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/УСОERP_ГрафикиАктированияФинансирования/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	
	Если ВидГрафика = Перечисления.УСОERP_ВидыГрафиковАктированияФинансирования.ГрафикФинансирования Тогда
		Если Этапы.Итог("ПроцентПлатежа") <> 100 Тогда
			
			ТекстОшибки = НСтр("ru='Процент платежей по всем этапам должен быть равен 100%'");
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки,
			ЭтотОбъект,
			"Этапы",
			,
			Отказ);
			
		КонецЕсли;
		
		КоличествоЭтапов = Этапы.Количество();
		
		Если КоличествоЭтапов >= 2 Тогда
			
			Для ВнешнийСчетчик = 2 По КоличествоЭтапов Цикл
				
				ИндексПредыдущегоЭтапа           = ВнешнийСчетчик - 2;
				ИндексТекущегоЭтапа              = ВнешнийСчетчик - 1;
				ПредыдущееЗначениеВариантаОплаты = Этапы[ИндексПредыдущегоЭтапа].ВариантОплаты;
				ПредыдущееЗначениеСдвига         = Этапы[ИндексПредыдущегоЭтапа].Сдвиг;
				ТекущееЗначениеВариантаОплаты    = Этапы[ИндексТекущегоЭтапа].ВариантОплаты;
				ТекущееЗначениеСдвига            = Этапы[ИндексТекущегоЭтапа].Сдвиг;
				
				// В табличной части Этапы не должно быть строк со значением АвансДоОбеспечения
				// в поле ВариантОплаты, идущих после строк со значением ПредоплатаДоОтгрузки
				// КредитПослеОтгрузки
				Если (ТекущееЗначениеВариантаОплаты = Перечисления.ВариантыОплатыКлиентом.АвансДоОбеспечения И 
					(ПредыдущееЗначениеВариантаОплаты = Перечисления.ВариантыОплатыКлиентом.КредитПослеОтгрузки Или
					ПредыдущееЗначениеВариантаОплаты = Перечисления.ВариантыОплатыКлиентом.ПредоплатаДоОтгрузки)) Или
					// В табличной части Этапы не должно быть строк со значением ПредоплатаДоОтгрузки
					// в поле ВариантОплаты, идущих после строк со значением КредитПослеОтгрузки
					(ТекущееЗначениеВариантаОплаты = Перечисления.ВариантыОплатыКлиентом.ПредоплатаДоОтгрузки И 
					ПредыдущееЗначениеВариантаОплаты = Перечисления.ВариантыОплатыКлиентом.КредитПослеОтгрузки) Тогда
					
					ТекстОшибки = НСтр("ru='Вариант оплаты ""%ТекущееЗначениеВариантаОплаты%"" в строке %ИндексТекущегоЭтапа%
					|не может идти после варианта оплаты ""%ПредыдущееЗначениеВариантаОплаты%"" в строке %ИндексПредыдущегоЭтапа%'");
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ПредыдущееЗначениеВариантаОплаты%", ПредыдущееЗначениеВариантаОплаты);
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ТекущееЗначениеВариантаОплаты%",    ТекущееЗначениеВариантаОплаты);
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ИндексТекущегоЭтапа%",              ИндексТекущегоЭтапа + 1);
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ИндексПредыдущегоЭтапа%",           ИндексПредыдущегоЭтапа + 1);
					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					ТекстОшибки,
					ЭтотОбъект,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Этапы",ИндексТекущегоЭтапа+1,"ВариантОплаты"),
					,
					Отказ);
					
				КонецЕсли;
				
				// Значение поля Сдвиг табличной части Этапы должно идти по возрастанию для 
				// вариантов оплаты Аванс (АвансДоОбеспечения, ПредоплатаДоОтгрузки) и Кредит 
				// (КредитПослеОтгрузки). Это необходимо для того, чтобы при заполнении 
				// фактического графика в документе продажи в строках не оказалось дат, 
				// превышающих значения дат в последующих строках.
				Если (((ТекущееЗначениеВариантаОплаты = Перечисления.ВариантыОплатыКлиентом.АвансДоОбеспечения Или
					ТекущееЗначениеВариантаОплаты = Перечисления.ВариантыОплатыКлиентом.ПредоплатаДоОтгрузки) И 
					(ПредыдущееЗначениеВариантаОплаты = Перечисления.ВариантыОплатыКлиентом.АвансДоОбеспечения Или
					ТекущееЗначениеВариантаОплаты = Перечисления.ВариантыОплатыКлиентом.ПредоплатаДоОтгрузки)) Или
					(ТекущееЗначениеВариантаОплаты = Перечисления.ВариантыОплатыКлиентом.КредитПослеОтгрузки И 
					ПредыдущееЗначениеВариантаОплаты = ТекущееЗначениеВариантаОплаты)) И
					ТекущееЗначениеСдвига < ПредыдущееЗначениеСдвига Тогда
					
					ТекстОшибки = НСтр("ru='Отсрочка в строке %ИндексТекущегоЭтапа% 
					| должна быть не меньше, чем в строке %ИндексПредыдущегоЭтапа%'");
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ИндексТекущегоЭтапа%",    ИндексТекущегоЭтапа + 1);
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ИндексПредыдущегоЭтапа%", ИндексПредыдущегоЭтапа + 1);
					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					ТекстОшибки,
					ЭтотОбъект,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Этапы",ИндексТекущегоЭтапа+1,"Сдвиг"),
					,
					Отказ);
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		НепроверяемыеРеквизиты = Новый Массив;
		НепроверяемыеРеквизиты.Добавить("Этапы.ПроцентПлатежа");
		НепроверяемыеРеквизиты.Добавить("Этапы.ПроцентЗалогаЗаТару");
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
		Для Каждого ЭтапОплаты Из Этапы Цикл
			
			Если Не ЗначениеЗаполнено(ЭтапОплаты.ПроцентПлатежа) И Не ЗначениеЗаполнено(ЭтапОплаты.ПроцентЗалогаЗаТару) Тогда
				
				ТекстОшибки = НСтр("ru='В строке для этапа должен быть указан процент платежа'");
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстОшибки,
				ЭтотОбъект,
				"Этапы[" + ЭтапОплаты.НомерСтроки + "]",
				,
				Отказ);
				
			КонецЕсли;
			
		КонецЦикла;
	Иначе
		Если Не ЗначениеЗаполнено(ВариантАктирования) Тогда
			 ТекстОшибки = НСтр("ru='Вариант актирования должен быть заполнен'");
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки,
			ЭтотОбъект,
			"ВариантАктирования",
			,
			Отказ);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ВидГрафика = Перечисления.УСОERP_ВидыГрафиковАктированияФинансирования.ГрафикФинансирования Тогда
		// Проверим наличие только кредитных этапов оплаты в графике.
		ТолькоКредитныеЭтапыВГрафике = Истина;
		Для Каждого СтрокаТаблицы Из Этапы Цикл
			Если СтрокаТаблицы.ВариантОплаты <> Перечисления.ВариантыОплатыКлиентом.КредитПослеОтгрузки Тогда
				ТолькоКредитныеЭтапыВГрафике = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ТолькоКредитныеЭтапы <> ТолькоКредитныеЭтапыВГрафике Тогда
			ТолькоКредитныеЭтапы = ТолькоКредитныеЭтапыВГрафике;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
